Revit 2027 API
RailJoinOption Enumeration
 The join type of the system rails.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailJoinOption
Public Enumeration RailJoinOption
public enum class RailJoinOption
type RailJoinOption
Members
Member name | Value | Description
ByType | -1 |  The rails will be joined according to the settings in the rail type.
Fillet | 1 |  The rails will be joined by a fillet connection.
Miter | 0 |  The rails will be joined by a miter connection.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace